wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/BlueCoin/BlueCoin.c
/**
******************************************************************************
* @file    BlueCoin.c
* @author  SRA - Central Labs
* @version v2.1.0
* @date    5-Apr-2019
* @brief   This file provides low level functionalities for BlueCoin board.
******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/

/* File Info: ------------------------------------------------------------------


------------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "BlueCoin.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_it.h"
#include "stm32f4xx_hal_exti.h"

/** @addtogroup BSP
* @{
*/

/** @defgroup BlueCoin
* @{
*/

/** @defgroup BlueCoin_COMMON BlueCoin_COMMON
* @{
*/


/** @defgroup BlueCoin_COMMON_Private_Defines BlueCoin_COMMON_Private_Defines
* @{
*/


/**
* @brief BlueCoin BSP Driver version number v2.1.0
*/
#define __BlueCoin_BSP_VERSION_MAIN   (0x02) /*!< [31:24] main version */
#define __BlueCoin_BSP_VERSION_SUB1   (0x01) /*!< [23:16] sub1 version */
#define __BlueCoin_BSP_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define __BlueCoin_BSP_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define __BlueCoin_BSP_VERSION         ((__BlueCoin_BSP_VERSION_MAIN << 24)\
                                        |(__BlueCoin_BSP_VERSION_SUB1 << 16)\
                                        |(__BlueCoin_BSP_VERSION_SUB2 << 8 )\
                                        |(__BlueCoin_BSP_VERSION_RC))



/**
* @}
*/


I2C_HandleTypeDef    I2C_ONBOARD_SENSORS_Handle;
ADC_HandleTypeDef    AdcHandle;
IWDG_HandleTypeDef   IwdgHandle;


/** @defgroup BlueCoin_COMMON_Private_Variables BlueCoin_COMMON_Private_Variables
* @{
*/
static uint32_t msLastTicks[2] = {1,1};
volatile static ChrgStatus_t ChrgStatus;
volatile uint8_t IT_I2C_error_af=0;					
__IO uint16_t uhADCxConvertedValue = 0;
volatile static uint8_t BatMSEnable=0;

GPIO_TypeDef* GPIO_PORT[LEDn] =
{
  LED1_GPIO_PORT,
  LED2_GPIO_PORT,
  LED3_GPIO_PORT,
  LED4_GPIO_PORT,
  LED5_GPIO_PORT,
  LED6_GPIO_PORT,
  LED7_GPIO_PORT,
  LED8_GPIO_PORT
};

const uint32_t GPIO_PIN[LEDn] =
{
  LED1_PIN,
  LED2_PIN,
  LED3_PIN,
  LED4_PIN,
  LED5_PIN,
  LED6_PIN,
  LED7_PIN,
  LED8_PIN
};

GPIO_TypeDef* BUTTON_PORT[BUTTONn] =
{
  BUTTON_1_GPIO_PORT,
  BUTTON_2_GPIO_PORT
};

const uint16_t BUTTON_PIN[BUTTONn] =
{
  BUTTON_1_PIN,
  BUTTON_2_PIN
};

const uint16_t BUTTON_IRQn[BUTTONn] =
{
  BUTTON_1_EXTI_IRQn,
  BUTTON_2_EXTI_IRQn
};

/**
* @}
*/

static void                     ADC_BLUECOIN_MspInit(void);
static void                     ADC_BLUECOIN_MspDeInit(void);
void                            LSM6DSM_Sensor_IO_ITConfig( void );


/** @defgroup BlueCoin_COMMON_Private_Functions BlueCoin_COMMON_Public_Functions
* @{
*/

/**
* @brief  This method returns the BlueCoin EVAL BSP Driver revision
* @param  None
* @retval version: 0xXYZR (8bits for each decimal, R for RC)
*/
uint32_t BSP_GetVersion(void)
{
  return __BlueCoin_BSP_VERSION;
}

/**
* @brief  This function confgures the GPIO which manages the shutdown pin
* @param  None
* @retval version:
*/
void BSP_ShutDown_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  
  /* Enable the GPIO_LED clock */
  SHUTDOWN_GPIO_CLK_ENABLE();
  
  /* Configure the GPIO_LED pin */
  GPIO_InitStruct.Pin = SHUTDOWN_GPIO_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  
  /* Reset the pin before init to prevent glitches */
  HAL_GPIO_WritePin(SHUTDOWN_GPIO_PORT, SHUTDOWN_GPIO_PIN, GPIO_PIN_RESET);
  HAL_GPIO_Init(SHUTDOWN_GPIO_PORT, &GPIO_InitStruct);
}

/**
* @brief  This function manages the shutdown pin of STBC03J turning off the board
* @param  None
* @retval version
*/
void BSP_ShutDown(void)
{
  HAL_GPIO_WritePin(SHUTDOWN_GPIO_PORT, SHUTDOWN_GPIO_PIN, GPIO_PIN_SET);
}


/**
* @brief Confgure the STM32 internal watchdog. IWDG counter clock Period
* is set to 4ms, watchdog timeout is 4ms*(ReloadN+1).
* @param  ReloadN: IWDG down-counter reload value [0-4095]
* @retval version:
*/
DrvStatusTypeDef BSP_Watchdog_Init(uint16_t ReloadN)
{
  /* Set counter reload value to obtain 4ms*(ReloadN+1) IWDG TimeOut.
     IWDG counter clock Period = 1 / (LsiFreq / Prescaler) = 1/(32KHz/128) = 4ms */
  IwdgHandle.Instance = IWDG;

  IwdgHandle.Init.Prescaler = IWDG_PRESCALER_128;
  IwdgHandle.Init.Reload    = (ReloadN&0xFFF);

  if (HAL_IWDG_Init(&IwdgHandle) != HAL_OK)
  {
    /* Initialization Error */
    return COMPONENT_ERROR;
  }
  
  return COMPONENT_OK;
}

/**
* @brief  Refresh the STM32 internal watchdog
* @param  none
* @retval none
*/
void BSP_Watchdog_Refresh()
{
  HAL_IWDG_Refresh(&IwdgHandle);
}


/**
* @brief  This method init the GPIO for charger status routine
* @param  None
* @retval none
*/
void BSP_ChrgPin_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  
