wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/BlueCoin/BlueCoin.c
  /* Enable the GPIO_LED clock */
  CHRG_GPIO_CLK_ENABLE();
 
  /* Configure the GPIO_LED pin */
  GPIO_InitStruct.Pin = CHRG_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  
  HAL_GPIO_Init(CHRG_GPIO_PORT, &GPIO_InitStruct);
  
  HAL_NVIC_SetPriority(CHRG_EXTI_IRQn, 3, 0x00);
  HAL_NVIC_EnableIRQ(CHRG_EXTI_IRQn);
}

/**
* @brief  This method get the charger status of the board
* @param  None
* @retval Charger status
*/
ChrgStatus_t BSP_GetChrgStatus(void)
{  
  uint32_t timeElapsed = HAL_GetTick()-msLastTicks[0];
 
  if(timeElapsed > 1000 && HAL_GPIO_ReadPin(CHRG_GPIO_PORT,CHRG_PIN) == GPIO_PIN_SET)
  {
    ChrgStatus = CHRG_STATUS_DISCHARGING;
  }
  return ChrgStatus;
}

/**
* @brief Update board charging status value
* @param  system tick
* @retval None
*/
void BSP_SetLastChrgTick(uint32_t msTick)
{
  float freqs[2];
  
  freqs[0] = 1000/(((float)msTick-(float)msLastTicks[0]));
  freqs[1] = 1000/((float)msLastTicks[0]-(float)msLastTicks[1]);
  
  msLastTicks[1]=msLastTicks[0];
  msLastTicks[0]=msTick;
    
  if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_EOC,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_EOC,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_EOC;
  }
  else if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_PRE_FAST,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_PRE_FAST,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_CHARGING;
  }
  else if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_OVER_CHRG,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_OVER_CHRG,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_OVER_CHRG;
  }
  else if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_TIMEOUT,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_TIMEOUT,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_TIMEOUT;
  }
  else if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_BEL_VPPRE,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_BEL_VPPRE,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_BEL_VPPRE;
  }
  else if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_THERMAL_WARNING,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_THERMAL_WARNING,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_THERMAL_WARNING;
  }
  else if(CHECK_BOUNDS(freqs[0],STBC03J_CHG_NTC_WARNING,STBC03J_CHG_FREQ_TH) && CHECK_BOUNDS(freqs[1],STBC03J_CHG_NTC_WARNING,STBC03J_CHG_FREQ_TH))
  {
    ChrgStatus = CHRG_STATUS_NTC_WARNING;
  }
  else
  {
    ChrgStatus = CHRG_STATUS_DISCHARGING;
  }
  
}

/**
* @brief  This method reset the peripherals used to get the current voltage of battery
* @param  None
* @retval BSP_ERROR_NONE in case of success
* @retval BSP_ERROR_COMPONENT_FAILURE in case of failures
*/
DrvStatusTypeDef BSP_BatMS_DeInit(void)
{
  if (HAL_ADC_DeInit(&AdcHandle) != HAL_OK)
  {
    /* ADC de-initialization Error */
    return COMPONENT_ERROR;
  }
  ADC_BLUECOIN_MspDeInit();
  
  return COMPONENT_OK;
  
}

/**
* @brief  This method initializes the peripherals used to get the current voltage of battery
* @param  None
* @retval BSP_ERROR_NONE in case of success
* @retval BSP_ERROR_COMPONENT_FAILURE in case of failures
*/
DrvStatusTypeDef BSP_BatMS_Init(void)
{
  /* Variable used to get converted value */
  ADC_ChannelConfTypeDef sConfig;
  
  GPIO_InitTypeDef  GPIO_InitStruct;
  
  BATMS_EN_GPIO_CLK_ENABLE();
  
  GPIO_InitStruct.Pin = BATMS_EN_GPIO_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  
  HAL_GPIO_WritePin(BATMS_EN_GPIO_PORT, BATMS_EN_GPIO_PIN, GPIO_PIN_RESET);
  HAL_GPIO_Init(BATMS_EN_GPIO_PORT, &GPIO_InitStruct); 
  
   /*##-1- Configure the ADC peripheral #######################################*/
  AdcHandle.Instance          = BATTERY_MONITOR_ADC;
  
  if (HAL_ADC_DeInit(&AdcHandle) != HAL_OK)
  {
    /* ADC de-initialization Error */
    return COMPONENT_ERROR;
  }

  AdcHandle.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV4;   /* Asynchronous clock mode, input ADC clock not divided */
  AdcHandle.Init.Resolution            = ADC_RESOLUTION_12B;             /* 12-bit resolution for converted data */
  AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;            /* Right-alignment for converted data */
  AdcHandle.Init.ScanConvMode          = DISABLE;                        /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  AdcHandle.Init.EOCSelection          = DISABLE;                        /* EOC flag picked-up to indicate conversion end */
  AdcHandle.Init.ContinuousConvMode    = DISABLE;                        /* Continuous mode disabled to have only 1 conversion at each conversion trig */
  AdcHandle.Init.NbrOfConversion       = 1;                              /* Parameter discarded because sequencer is disabled */
  AdcHandle.Init.DiscontinuousConvMode = DISABLE;                        /* Parameter discarded because sequencer is disabled */
  AdcHandle.Init.NbrOfDiscConversion   = 0;                              /* Parameter discarded because sequencer is disabled */
  AdcHandle.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;    /* Software start to trig the 1st conversion manually, without external event */
  AdcHandle.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;  /* Parameter discarded because software trigger chosen */
  AdcHandle.Init.DMAContinuousRequests = DISABLE;                        /* DMA one-shot mode selected (not applied to this example) */
  
  
  ADC_BLUECOIN_MspInit();
  
  if (HAL_ADC_Init(&AdcHandle) != HAL_OK)
  {
    return COMPONENT_ERROR;
  }
  
  /*##-2- Configure ADC regular channel ######################################*/
  sConfig.Channel      = BATTERY_MONITOR_ADC_CHANNEL;                /* Sampled channel number */
  sConfig.Rank         = 1;          /* Rank of sampled channel number BATTERY_MONITOR_ADC_CHANNEL */
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;    /* Sampling time (number of clock cycles unit) */
  sConfig.Offset = 0;                                 /* Parameter discarded because offset correction is disabled */
  
  if (HAL_ADC_ConfigChannel(&AdcHandle, &sConfig) != HAL_OK)
  {
    /* Channel Configuration Error */
    return COMPONENT_ERROR;
  }
  
  return COMPONENT_OK;
}

/**
* @brief  This method enables the sensing of the current voltage of battery
* @param  None
* @retval None
*/
void BSP_BatMS_Enable(void)
{
  HAL_GPIO_WritePin(BATMS_EN_GPIO_PORT, BATMS_EN_GPIO_PIN, GPIO_PIN_SET);
  BatMSEnable=1;
}

/**
* @brief  This method disable the sensing of the current voltage of battery
* @param  None
* @retval None
*/
void BSP_BatMS_Disable(void)
{
  HAL_GPIO_WritePin(BATMS_EN_GPIO_PORT, BATMS_EN_GPIO_PIN, GPIO_PIN_RESET);
  BatMSEnable=0;
}

/**
* @brief  This method enables the sensing of the current voltage of battery
* @param  None
* @retval None
*/
uint8_t BSP_BatMS_isEnable(void)
{
  return BatMSEnable;
}

/**
* @brief  This method gets the current voltage of battery
* @param  volt pointer to destination variable
* @retval BSP_ERROR_NONE in case of success
* @retval BSP_ERROR_COMPONENT_FAILURE in case of failures
*/
DrvStatusTypeDef BSP_GetVoltage(uint16_t *volt)
{

  if(!BSP_BatMS_isEnable())
  {
    BSP_BatMS_Enable();
    HAL_Delay(1);
  }
  /*##-3- Start the conversion process #######################################*/
  if (HAL_ADC_Start(&AdcHandle) != HAL_OK)
  {
    /* Start Conversation Error */
    return COMPONENT_ERROR;
  }
  
  /*##-4- Wait for the end of conversion #####################################*/
  /*  Before starting a new conversion, you need to check the current state of
  the peripheral; if it’s busy you need to wait for the end of current
  conversion before starting a new one.
  For simplicity reasons, this example is just waiting till the end of the
  conversion, but application may perform other tasks while conversion
  operation is ongoing. */
  if (HAL_ADC_PollForConversion(&AdcHandle, 10) != HAL_OK)
  {
    /* End Of Conversion flag not set on time */
    return COMPONENT_ERROR;
  }
  
  /* Check if the continuous conversion of regular channel is finished */
  if ((HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_EOC_REG) == HAL_ADC_STATE_EOC_REG)
  {
    /*##-5- Get the converted value of regular channel  ########################*/
    uhADCxConvertedValue = HAL_ADC_GetValue(&AdcHandle);
  }
  
  if(BSP_BatMS_isEnable())
  {
    BSP_BatMS_Disable();
  }
  
  
