wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/BlueCoin/BlueCoin.c
  uint32_t Voltage;
  Voltage = (3000 * (uint32_t)uhADCxConvertedValue) / (4095);  // [0-3V]
  Voltage = ((56+133)*Voltage)/133;   // [0-4.2V]
  
  *volt= Voltage;
  
  return COMPONENT_OK;
}

/**
  * @brief ADC MSP Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param None
  * @retval None
  */
void ADC_BLUECOIN_MspInit(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* ADC Periph clock enable */
  BATTERY_MONITOR_ADC_CLK_ENABLE();
  /* Enable GPIO clock ****************************************/
  BATTERY_MONITOR_GPIO_CLK_ENABLE();
  
  /*##-2- Configure peripheral GPIO ##########################################*/
  /* ADC Channel GPIO pin configuration */
  GPIO_InitStruct.Pin = BATTERY_MONITOR_GPIO_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(BATTERY_MONITOR_GPIO_PORT, &GPIO_InitStruct);
}

/**
  * @brief ADC MSP De-Initialization
  *        This function frees the hardware resources used in this example:
  *          - Disable the Peripheral's clock
  *          - Revert GPIO to their default state
  * @param None
  * @retval None
  */
void ADC_BLUECOIN_MspDeInit(void)
{

  /*##-1- Reset peripherals ##################################################*/
  BATTERY_MONITOR_ADC_FORCE_RESET();
  BATTERY_MONITOR_ADC_RELEASE_RESET();
  
  /*##-2- Disable peripherals and GPIO Clocks ################################*/
  /* De-initialize the ADC Channel GPIO pin */
  HAL_GPIO_DeInit(BATTERY_MONITOR_GPIO_PORT, BATTERY_MONITOR_GPIO_PIN);
}

/**
* @brief  Configures LEDs.
* @param  Led: LED to be configured.
*          This parameter can be one of the following values:
*            @arg  LED1
*            @arg  LED2
*            @arg  LED3
*            @arg  LED4
*            @arg  LED5
*            @arg  LED6
*            @arg  LED7
*            @arg  LED8
* @retval None
*/
void BSP_LED_Init(Led_TypeDef Led)
{

  GPIO_InitTypeDef  GPIO_InitStruct;
  
  /* Enable the GPIO_LED clock */
  LEDx_GPIO_CLK_ENABLE(Led);
  
  /* Configure the GPIO_LED pin */
  GPIO_InitStruct.Pin = GPIO_PIN[Led];
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  
  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_RESET);
  HAL_GPIO_Init(GPIO_PORT[Led], &GPIO_InitStruct);
}

/**
* @brief  DeInit LEDs.
* @param  Led: LED to be configured.
*          This parameter can be one of the following values:
*            @arg  LED1
*            @arg  LED2
*            @arg  LED3
*            @arg  LED4
*            @arg  LED5
*            @arg  LED6
*            @arg  LED7
*            @arg  LED8
* @note Led DeInit does not disable the GPIO clock nor disable the Mfx
* @retval None
*/
void BSP_LED_DeInit(Led_TypeDef Led)
{
    HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_RESET);
    LEDx_GPIO_CLK_DISABLE(Led);
}

/**
* @brief  Turns selected LED On.
* @param  Led: LED to be set on
*          This parameter can be one of the following values:
*            @arg  LED1
*            @arg  LED2
*            @arg  LED3
*            @arg  LED4
*            @arg  LED5
*            @arg  LED6
*            @arg  LED7
*            @arg  LED8
* @retval None
*/
void BSP_LED_On(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_SET);
}

/**
* @brief  Turns selected LED Off.
* @param  Led: LED to be set off
*          This parameter can be one of the following values:
*            @arg  LED1
*            @arg  LED2
*            @arg  LED3
*            @arg  LED4
*            @arg  LED5
*            @arg  LED6
*            @arg  LED7
*            @arg  LED8
* @retval None
*/
void BSP_LED_Off(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(GPIO_PORT[Led], GPIO_PIN[Led], GPIO_PIN_RESET);
}


/**
* @brief  Toggles the selected LED.
* @param  Led: LED to be toggled
*          This parameter can be one of the following values:
*            @arg  LED1
*            @arg  LED2
*            @arg  LED3
*            @arg  LED4
*            @arg  LED5
*            @arg  LED6
*            @arg  LED7
*            @arg  LED8
* @retval None
*/
void BSP_LED_Toggle(Led_TypeDef Led)
{
  HAL_GPIO_TogglePin(GPIO_PORT[Led], GPIO_PIN[Led]);
}

/**
* @brief  Configures button GPIO and EXTI Line.
* @param  Button: Button to be configured
*          This parameter can be one of the following values:
*            @arg  BUTTON_1: Push Button 1
*            @arg  BUTTON_2: Push Button 2
* @param  ButtonMode: Button mode
*          This parameter can be one of the following values:
*            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
*            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
*                                    with interrupt generation capability
* @retval None
*/
void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpio_init_structure;
  
  /* Enable the BUTTON clock */
  BUTTONx_GPIO_CLK_ENABLE(Button);
  
  if(ButtonMode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    gpio_init_structure.Pin = BUTTON_PIN[Button];
    gpio_init_structure.Mode = GPIO_MODE_INPUT;
    gpio_init_structure.Pull = GPIO_PULLDOWN;
    gpio_init_structure.Speed = GPIO_SPEED_FAST;
    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);
  }
  
  if(ButtonMode == BUTTON_MODE_EXTI)
  {
    /* Configure Button pin as input with External interrupt */
    gpio_init_structure.Pin = BUTTON_PIN[Button];
    gpio_init_structure.Speed = GPIO_SPEED_FAST;
    if(Button == BUTTON_1)
    {
      gpio_init_structure.Pull = GPIO_PULLDOWN;
      gpio_init_structure.Mode = GPIO_MODE_IT_RISING;
    }
    else if (Button == BUTTON_2)
    {
      gpio_init_structure.Pull = GPIO_NOPULL;
      gpio_init_structure.Mode = GPIO_MODE_IT_RISING;
    }
    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);
    /* Enable and set Button EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority((IRQn_Type)(BUTTON_IRQn[Button]), 0x0F, 0x00);
    HAL_NVIC_EnableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
  }
}

/**
* @brief  Push Button DeInit.
* @param  Button: Button to be configured
*          This parameter can be one of the following values:
*            @arg  BUTTON_WAKEUP: Wakeup Push Button
*            @arg  BUTTON_TAMPER: Tamper Push Button
*            @arg  BUTTON_KEY: Key Push Button
* @note PB DeInit does not disable the GPIO clock
* @retval None
*/
void BSP_PB_DeInit(Button_TypeDef Button)
{
  GPIO_InitTypeDef gpio_init_structure;
  
  gpio_init_structure.Pin = BUTTON_PIN[Button];
  HAL_NVIC_DisableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
  HAL_GPIO_DeInit(BUTTON_PORT[Button], gpio_init_structure.Pin);
}


/**
* @brief  Returns the selected button state.
* @param  Button: Button to be checked
*          This parameter can be one of the following values:
*            @arg  BUTTON_WAKEUP: Wakeup Push Button
*            @arg  BUTTON_TAMPER: Tamper Push Button
*            @arg  BUTTON_KEY: Key Push Button
* @retval The Button GPIO pin value
*/
uint32_t BSP_PB_GetState(Button_TypeDef Button)
{
  return HAL_GPIO_ReadPin(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}

/**
* @brief  Configures GPIO Mics1234 Source Selector.
* @param  None
* @retval None
*/
void BSP_Mic234_Clock_Selector_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
