wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/BlueCoin/BlueCoin.c
  /* Enable the Mics123SourceSelector Clock */
  MIC234_CLK_EN_GPIO_CLK_ENABLE();
  
  /* Configure the Mics123SourceSelector pin */
  GPIO_InitStruct.Pin = MIC234_CLK_EN_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  
  HAL_GPIO_Init(MIC234_CLK_EN_GPIO_PORT, &GPIO_InitStruct);
  
  HAL_GPIO_WritePin(MIC234_CLK_EN_GPIO_PORT, MIC234_CLK_EN_PIN, GPIO_PIN_SET);
}

/**
* @brief  Mics 1234 Source switch.
* @param  Mics1234Source: Specifies the Mics1234 Source to be configured.
*   This parameter can be one of following parameters:
*     @arg ONBOARD
*     @arg EXTERNAL
* @retval None
*/
void BSP_Mic234_Clock_Selector_Set(Mic234Clk_Status_TypeDef Mic234Clk_Status)
{
  if (Mic234Clk_Status == CLK_ENABLE)
  {
    HAL_GPIO_WritePin(MIC234_CLK_EN_GPIO_PORT, MIC234_CLK_EN_PIN, GPIO_PIN_SET);
  }
  if (Mic234Clk_Status == CLK_DISABLE)
  {
    HAL_GPIO_WritePin(MIC234_CLK_EN_GPIO_PORT, MIC234_CLK_EN_PIN, GPIO_PIN_RESET);
  }
}


uint8_t BSP_isBattPlugged()
{
  uint16_t voltage;
  static int i=0;
  static float delta=0.0f;
  static float delta2=0.0f;
  static float mean=0.0f;
  static float M2=0.0f;
  static uint8_t flag =0;
  
  if(i++ <= 100)
  {
    BSP_GetVoltage(&voltage);
    delta= (float)voltage - mean;
    mean= mean +delta/i;
    delta2= (float)voltage -mean;
    M2= M2+ delta*delta2;
  }
  else
  {
    flag= ((M2/(i-1)) < 10000.0f) ? 1 : 0;
    i=0;
    delta=0.0f;
    delta2=0.0f;
    mean=0.0f;
    M2=0.0f;
   
  }
  return flag;
 
}

/**
 * @brief  Configures shutdown pin to switch on the VL53L0x on CoinStation expansion
 * @retval None
 */
void BSP_PROX_Pin_init()
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  __GPIOC_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  
}

/**
 * @brief  Switch on the VL53L0x on CoinStation expansion
 * @retval None
 */
void BSP_PROX_Pin_On()
{
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);
}

/**
 * @brief  Switch off the VL53L0x on CoinStation expansion
 * @retval None
 */
void BSP_PROX_Pin_Off()
{
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_RESET);
}



/**
  * @brief  I2C error callback fot interrupt mode comunication.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
void I2C_ErrorCallback_PROX(I2C_HandleTypeDef *hi2c)
{
  uint32_t er=0x00;
  
  er= HAL_I2C_GetError(hi2c);
  
  if(er == HAL_I2C_ERROR_AF)
  {
    IT_I2C_error_af=1;
  }
}

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
